In [1]:
import pandas as pd
import seaborn as sns

## Ethiopia Production

In [2]:
prod_df = pd.read_csv('./data/production.csv')

In [3]:
prod_df.shape

(56, 32)

In [4]:
prod_df = prod_df.T

In [5]:
eth_prod = pd.DataFrame(prod_df)

In [6]:
header = eth_prod.iloc[0]
eth_prod = eth_prod[1:]
eth_prod.columns = header

In [7]:
eth_prod.head()

Unnamed: 0,5,6,7,8,9,10,11,12,13,14,...,55,56,57,58,59,60,61,62,63,65
Crop year,Angola,Bolivia (Plurinational State of),Brazil,Burundi,Ecuador,Indonesia,Madagascar,Malawi,Papua New Guinea,Paraguay,...,Sierra Leone,Sri Lanka,Thailand,Togo,Trinidad & Tobago,Uganda,Venezuela,Viet Nam,Yemen,Total
1990/91,50.345,122.777,27285.6286,487.393,1503.815,7441.383,982.447,104.628,962.841,130.627,...,42.783,95.87,757.017,161.308,14.581,1955.009,1122.477,1310.288,0.0,93230.0596
1991/92,79.331,103.536,27293.4934,667.199,2123.824,8493.196,932.513,124.286,746.816,79.653,...,54.379,81.549,1468.936,432.652,17.792,2088.001,940.704,1437.848,0.0,101266.6844
1992/93,77.52,120.235,34603.3542,620.238,1185.48,5569.478,1121.684,137.161,900.111,54.291,...,39.084,53.181,1254.945,85.648,14.328,2185.074,1215.298,2340.447,0.0,98524.0942
1993/94,32.608,50.823,28166.9786,393.354,2069.007,6743.288,441.859,62.111,1019.481,66.5275,...,37.451,53.79,1275.201,194.939,16.079,3141.706,1332.881,3020.216,0.0,91761.0531

In [8]:
#setting column name as the country names
eth_prod.columns = eth_prod.iloc[0]

In [9]:
# dropping first row
eth_prod = eth_prod.iloc[1:]

In [10]:
eth_prod = eth_prod[['Ethiopia']]

In [11]:
eth_prod.head()

Crop year  Ethiopia
1990/91    2909.451
1991/92    2924.664
1992/93    1825.171
1993/94    2967.004
1994/95     2762.73

## Retail Prices

In [12]:
retail_prices = pd.read_excel('./data/3b - retail_prices.xlsx')

In [13]:
retail_prices.head()

,Year,Austria,Belgium,Bulgaria,Cyprus,Czechia,Denmark,Finland,France,Germany,...,Slovakia,Slovenia,Spain,Sweden,Japan,Norway,Russian Federation,Switzerland,United Kingdom 1,United States of America
0,1990,4.90,3.27,NaN,2.83,NaN,3.81,2.98,3.73,3.99,...,NaN,NaN,3.62,3.43,10.26,3.31,NaN,4.83,10.55,2.97
1,1991,4.57,2.92,NaN,2.80,NaN,3.67,2.72,3.43,3.84,...,NaN,NaN,3.50,3.29,11.88,3.16,NaN,4.36,10.41,2.81
2,1992,4.99,3.05,NaN,2.87,NaN,3.79,2.46,2.31,4.00,...,NaN,NaN,3.50,3.11,12.62,3.12,NaN,4.52,10.09,2.58
3,1993,4.97,2.78,NaN,2.60,NaN,3.48,1.94,2.03,3.62,...,NaN,NaN,2.79,2.65,14.57,2.46,NaN,4.27,8.44,2.47
4,1994,4.58,3.42,NaN,3.18,NaN,4.45,2.73,2.40,4.18,...,NaN,NaN,2.76,3.79,14.69,3.29,NaN,4.50,11.36,3.40

## Ethiopia Temp

In [14]:
temp_df = pd.read_csv('data/FAOSTAT_data_1-10-2022.csv')

In [16]:
ethiopia_temp_change = temp_df[temp_df.Area == 'Ethiopia']

In [17]:
ethiopia_temp_change.columns = [col.lower().strip().replace(' ', '_')
    for col in ethiopia_temp_change.columns]

In [18]:
ethiopia_temp_change = ethiopia_temp_change[ethiopia_temp_change['months']=='Meteorological year'].sort_values(by=['months', 'year'], ascending= False)

In [19]:
e_temp_change = ethiopia_temp_change[['year','value']].iloc[::-1]

In [20]:
e_temp_change.rename(columns={'value':'e_temp_change'}, inplace = True)

In [21]:
e_temp_change.head()

       year  e_temp_change
70182  1993          0.244
70183  1994          0.599
70184  1995          0.815
70185  1996          0.775
70186  1997          0.713

## Ethiopia Exports

In [22]:
e_export = pd.read_excel('./data/2a - Exports - calendar year.xlsx')

In [23]:
e_export.dropna(inplace = True)

In [24]:
e_export = e_export.T

In [25]:
new_header = e_export.iloc[0]
e_export = e_export[1:] 
e_export.columns = new_header

In [26]:
e_export.columns = [col.lower().strip().replace(' ','_') 
                         for col in e_export.columns]

In [27]:
e_export = e_export[['calendar_years','ethiopia']]

In [28]:
e_export.rename(columns={'calendar_years':'year', 'ethiopia':'e_export'}, inplace = True)

In [29]:
e_export.head()

              year  e_export
Unnamed: 1  1990.0  1074.101
Unnamed: 2  1991.0   841.329
Unnamed: 3  1992.0   734.461
Unnamed: 4  1993.0  1166.778
Unnamed: 5  1994.0  1475.325

## Ethiopia Domestic Consumption (Disappearance)

In [140]:
consumption = pd.read_excel('./data/1b - Domestic consumption.xlsx')

/Users/sangs/opt/anaconda3/lib/python3.9/site-packages/openpyxl/worksheet/_reader.py:312: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

In [141]:
consumption = consumption.T

In [142]:
new_header = consumption.iloc[0]
consumption = consumption[1:] 
consumption.columns = new_header

In [143]:
consumption = consumption.drop(consumption.index[:1])

In [144]:
consumption.head()

Domestic consumption by all exporting countries,In thousand 60kg bags,NaN,Crop year,NaN,April group,Angola,Bolivia (Plurinational State of),Brazil,Burundi,Ecuador,...,Thailand,Togo,Trinidad & Tobago,Uganda,Venezuela,Viet Nam,Yemen,NaN,Total,Â© International Coffee Organization
Unnamed: 2,NaN,NaN,1990/91,NaN,10408,20,25,8200,2,350,...,188,1,8,70,782.39,150,0,NaN,19509.211,NaN
Unnamed: 3,NaN,NaN,1991/92,NaN,10707.6,30,27,8500,1.6,350,...,220,1,11.5,75,815.48,230,0,NaN,20228.097,NaN
Unnamed: 4,NaN,NaN,1992/93,NaN,11212.2,35,27.5,8900,1.7,350,...,233,1,10,75,849.97,250,0,NaN,20951.452,NaN
Unnamed: 5,NaN,NaN,1993/94,NaN,11452.743,20,28.5,9100,1.91,350,...,250,1,10,75,885.93,267,0,NaN,21097.906,NaN
Unnamed: 6,NaN,NaN,1994/95,NaN,11506.499,25,29.5,9300,2,350,...,283,1,14,80,923.4,267,0,NaN,21360.166,NaN

In [145]:
consumption = consumption.drop(consumption.columns[:2], axis = 1)

In [146]:
consumption = consumption[['Crop year','Ethiopia']]

In [147]:
consumption.columns = [col.lower().strip().replace(' ','_') 
                         for col in consumption.columns]

In [148]:
consumption.head()

            crop_year ethiopia
Unnamed: 2    1990/91     1200
Unnamed: 3    1991/92     1264
Unnamed: 4    1992/93     1331
Unnamed: 5    1993/94     1402
Unnamed: 6    1994/95     1476
Unnamed: 7    1995/96     1555
Unnamed: 8    1996/97     1637
Unnamed: 9    1997/98     1724
Unnamed: 10   1998/99     1816
Unnamed: 11   1999/00     1912
Unnamed: 12   2000/01     2014
Unnamed: 13   2001/02     2121
Unnamed: 14   2002/03     2234
Unnamed: 15   2003/04     2353
Unnamed: 16   2004/05     2478
Unnamed: 17   2005/06     2609
Unnamed: 18   2006/07     2748
Unnamed: 19   2007/08     2894
Unnamed: 20   2008/09     3048
Unnamed: 21   2009/10     3109
Unnamed: 22   2010/11     3171
Unnamed: 23   2011/12     3235
Unnamed: 24   2012/13     3299
Unnamed: 25   2013/14     3365
Unnamed: 26   2014/15     3433
Unnamed: 27   2015/16     3501
Unnamed: 28   2016/17     3571
Unnamed: 29   2017/18     3643
Unnamed: 30   2018/19     3685
Unnamed: 31   2019/20     3781